; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v3 ?v1)
             (pred_5 ?v8 ?v12)
             (pred_8 ?v3 ?v12)
             (pred_9 ?v11 ?v3 )
	     (pred_11 ?v3)
             (pred_6 ?v4)
             (pred_3 ?v8)
             (pred_1 ?v12)
             (pred_4 ?v3)
             (pred_12 ?v8)
             (pred_7 ?v3)
             (pred_2 ))



(:action op_2
:parameters (?v10 ?v2 ?v5 ?v7)
:precondition (and (pred_6 ?v10) (pred_6 ?v2) (pred_3 ?v5) (pred_1 ?v7)
          (pred_10 ?v10 ?v2) (pred_5 ?v5 ?v7)
                   (pred_8 ?v2 ?v7) (pred_11 ?v10) 
                   (pred_4 ?v2) (pred_12 ?v5))
:effect (and  (pred_7 ?v2) (not (pred_4 ?v2))))


(:action op_5
:parameters (?v10 ?v9)
:precondition (and (pred_6 ?v10) (pred_6 ?v9)
               (pred_11 ?v10) (pred_10 ?v10 ?v9) (pred_7 ?v9))
:effect (and (pred_11 ?v9) (not (pred_11 ?v10))))

(:action op_4
:parameters (?v10 ?v5)
:precondition (and (pred_6 ?v10) (pred_3 ?v5) 
                  (pred_11 ?v10) (pred_9 ?v5 ?v10) (pred_2 ))
:effect (and (pred_12 ?v5)
   (not (pred_9 ?v5 ?v10)) (not (pred_2 ))))


(:action op_1
:parameters (?v10 ?v13 ?v6)
:precondition (and (pred_6 ?v10) (pred_3 ?v13) (pred_3 ?v6)
                  (pred_11 ?v10) (pred_12 ?v6) (pred_9 ?v13 ?v10))
:effect (and (pred_12 ?v13) (pred_9 ?v6 ?v10)
        (not (pred_12 ?v6)) (not (pred_9 ?v13 ?v10))))

(:action op_3
:parameters (?v10 ?v5)
:precondition (and (pred_6 ?v10) (pred_3 ?v5) 
                  (pred_11 ?v10) (pred_12 ?v5))
:effect (and (pred_2 ) (pred_9 ?v5 ?v10) (not (pred_12 ?v5)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_15 obj_04 obj_13 obj_11 obj_19 obj_14 obj_21 obj_06 obj_05 obj_01 obj_20 obj_09 obj_17 obj_12 obj_08
    obj_02 obj_07
    obj_18 obj_10 obj_16
    )

    (:init
       (pred_2)

       (pred_6 obj_03)
       (pred_6 obj_15)
       (pred_6 obj_04)
       (pred_6 obj_13)
       (pred_6 obj_11)
       (pred_6 obj_19)
       (pred_6 obj_14)
       (pred_6 obj_21)
       (pred_6 obj_06)
       (pred_6 obj_05)
       (pred_6 obj_01)
       (pred_6 obj_20)
       (pred_6 obj_09)
       (pred_6 obj_17)
       (pred_6 obj_12)
       (pred_6 obj_08)
       (pred_1 obj_02)
       (pred_1 obj_07)
       (pred_3 obj_18)
       (pred_3 obj_10)
       (pred_3 obj_16)

       (pred_10 obj_03 obj_11)
       (pred_10 obj_03 obj_15)
       (pred_10 obj_15 obj_19)
       (pred_10 obj_15 obj_04)
       (pred_10 obj_15 obj_03)
       (pred_10 obj_04 obj_14)
       (pred_10 obj_04 obj_13)
       (pred_10 obj_04 obj_15)
       (pred_10 obj_13 obj_21)
       (pred_10 obj_13 obj_04)
       (pred_10 obj_11 obj_06)
       (pred_10 obj_11 obj_19)
       (pred_10 obj_11 obj_03)
       (pred_10 obj_19 obj_05)
       (pred_10 obj_19 obj_14)
       (pred_10 obj_19 obj_15)
       (pred_10 obj_19 obj_11)
       (pred_10 obj_14 obj_01)
       (pred_10 obj_14 obj_21)
       (pred_10 obj_14 obj_04)
       (pred_10 obj_14 obj_19)
       (pred_10 obj_21 obj_20)
       (pred_10 obj_21 obj_13)
       (pred_10 obj_21 obj_14)
       (pred_10 obj_06 obj_09)
       (pred_10 obj_06 obj_05)
       (pred_10 obj_06 obj_11)
       (pred_10 obj_05 obj_17)
       (pred_10 obj_05 obj_01)
       (pred_10 obj_05 obj_19)
       (pred_10 obj_05 obj_06)
       (pred_10 obj_01 obj_12)
       (pred_10 obj_01 obj_20)
       (pred_10 obj_01 obj_14)
       (pred_10 obj_01 obj_05)
       (pred_10 obj_20 obj_08)
       (pred_10 obj_20 obj_21)
       (pred_10 obj_20 obj_01)
       (pred_10 obj_09 obj_17)
       (pred_10 obj_09 obj_06)
       (pred_10 obj_17 obj_12)
       (pred_10 obj_17 obj_05)
       (pred_10 obj_17 obj_09)
       (pred_10 obj_12 obj_08)
       (pred_10 obj_12 obj_01)
       (pred_10 obj_12 obj_17)
       (pred_10 obj_08 obj_20)
       (pred_10 obj_08 obj_12)
       (pred_4 obj_12)
       (pred_4 obj_09)
       (pred_4 obj_21)
       (pred_8  obj_12 obj_02)
       (pred_8  obj_09 obj_07)
       (pred_8  obj_21 obj_02)
       (pred_7 obj_03)
       (pred_7 obj_15)
       (pred_7 obj_04)
       (pred_7 obj_13)
       (pred_7 obj_11)
       (pred_7 obj_19)
       (pred_7 obj_14)
       (pred_7 obj_06)
       (pred_7 obj_05)
       (pred_7 obj_01)
       (pred_7 obj_20)
       (pred_7 obj_17)
       (pred_7 obj_08)

       (pred_5  obj_18 obj_02)
       (pred_5  obj_10 obj_07)
       (pred_5  obj_16 obj_07)
       (pred_9 obj_18 obj_13)
       (pred_9 obj_10 obj_13)
       (pred_9 obj_16 obj_15)
       (pred_11 obj_17)
    )

    (:goal (and
       (pred_9 obj_18 obj_01)
       (pred_9 obj_10 obj_03)
    ))
(:constraints
  (always (not (pred_11 obj_14)))
)
)

; plan
1. (op_5 obj_17 obj_05)
   deleted: (pred_11 obj_17)
   added: (pred_11 obj_05)
   goals met: 0 of 2
2. (op_5 obj_05 obj_19)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_19)
   goals met: 0 of 2
3. (op_5 obj_19 obj_15)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_15)
   goals met: 0 of 2
4. (op_5 obj_15 obj_04)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_04)
   goals met: 0 of 2
5. (op_5 obj_04 obj_13)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_13)
   goals met: 0 of 2
6. (op_4 obj_13 obj_10)
   deleted: (pred_9 obj_10 obj_13) (pred_2)
   added: (pred_12 obj_10)
   goals met: 0 of 2
7. (op_5 obj_13 obj_04)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_04)
   goals met: 0 of 2
8. (op_5 obj_04 obj_15)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_15)
   goals met: 0 of 2
9. (op_5 obj_15 obj_03)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_03)
   goals met: 0 of 2
10. (op_3 obj_03 obj_10)
   deleted: (pred_12 obj_10)
   added: (pred_2) (pred_9 obj_10 obj_03)
   goals met: 1 of 2
11. (op_5 obj_03 obj_15)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_15)
   goals met: 1 of 2
12. (op_5 obj_15 obj_04)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_04)
   goals met: 1 of 2
13. (op_5 obj_04 obj_13)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_13)
   goals met: 1 of 2
14. (op_4 obj_13 obj_18)
   deleted: (pred_9 obj_18 obj_13) (pred_2)
   added: (pred_12 obj_18)
   goals met: 1 of 2
15. (op_2 obj_13 obj_21 obj_18 obj_02)
   deleted: (pred_4 obj_21)
   added: (pred_7 obj_21)
   goals met: 1 of 2
16. (op_5 obj_13 obj_21)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_21)
   goals met: 1 of 2
17. (op_5 obj_21 obj_20)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_20)
   goals met: 1 of 2
18. (op_5 obj_20 obj_01)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_01)
   goals met: 1 of 2
19. (op_3 obj_01 obj_18)
   deleted: (pred_12 obj_18)
   added: (pred_2) (pred_9 obj_18 obj_01)
   goals met: 2 of 2
